       IDENTIFICATION DIVISION.
       PROGRAM-ID.  "HELLO, WORLD.".
       AUTHOR.  VARIK VALEFOR, THE O.G. MEATBALL.

       PROCEDURE DIVISION.
       DISPLAY "Hello, world.".
