       IDENTIFICATION DIVISION.
       PROGRAM-ID.  "0022".
       AUTHOR.  "VARIK VALEFOR".

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 ITSLIKEAJUNGLE PIC X(24) VALUE "We are the music makers.".
       01 GMFLASH PIC X(1).
       01 K PIC 9(2) VALUE 01.

       PROCEDURE DIVISION.
       PERFORM UNTIL 1 < 0
         PERFORM UNTIL (K > 24)
           CALL "CBL_GC_NANOSLEEP" USING "10000000" END-CALL
           MOVE FUNCTION REVERSE (FUNCTION REVERSE (ITSLIKEAJUNGLE))
             (K:1) TO GMFLASH
           ADD 1 TO K
           DISPLAY GMFLASH WITH NO ADVANCING
         END-PERFORM
         MOVE 1 TO K
         DISPLAY " "
       END-PERFORM.
