       IDENTIFICATION DIVISION.
       PROGRAM-ID.  FIBBER.
       AUTHOR.  VARIK VALEFOR, THE LIVING STJ STEREOTYPE

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 B1 PIC 9(38) VALUE 0.
       01 B2 PIC 9(38) VALUE 1.
       01 B3 PIC 9(38) VALUE 0.

       PROCEDURE DIVISION.
       A-PARA.
       ADD B1, B2 TO B3.
       SET B1 TO B2.
       SET B2 TO B3.
       IF B3 < 85498066198170591508868346415435408330 THEN
         DISPLAY B3
         GO TO A-PARA
       END-IF.
       DISPLAY 'THE NEXT NUMBER IS GREATER THAN THE MAXIMUM'.
       DISPLAY 'NUMBER WHICH IS SUPPORTED BY COBOL.'.
